app/views/categoris/show.html.erb

SELECT  "imagens"."imagen_uri" FROM "imagens" WHERE "imagens"."ins_cod_prov" = $1 LIMIT 1  [["ins_cod_prov", "1234"]]
---
     @aux.push(instanci.ins_cod_prov)%> <div class ="articulo">
    <% @imagen=Imagen.select("imagen_uri").where(ins_cod_prov: instanci.ins_cod_prov).take %>