app/controllers/art_props_controller.rb

  def index
    @art_props = ArtProp.all
---
SELECT "art_props".* FROM "art_props"

  def create
    @art_prop = ArtProp.new(art_prop_params)

    respond_to do |format|
      if @art_prop.save
---
INSERT INTO "art_props" ("prop_cod", "art_cod") VALUES ($1, $2) RETURNING "art_prop_cod"  [["prop_cod", 1], ["art_cod", 1]]