app/controllers/art_prop_vals_controller.rb

SELECT "art_prop_vals".* FROM "art_prop_vals"
---
  def index
    @art_prop_vals = ArtPropVal.all

INSERT INTO "art_prop_vals" ("val_cod", "art_cod", "prop_cod") VALUES ($1, $2, $3) RETURNING "apv_cod"  [["val_cod", 1], ["art_cod", 1], ["prop_cod", 1]]
---
  def create
    @art_prop_val = ArtPropVal.new(art_prop_val_params)

    respond_to do |format|
      if @art_prop_val.save