app/controllers/articulos_controller.rb

  def create
    @articulo = Articulo.new(articulo_params)

    respond_to do |format|
      if @articulo.save
---
INSERT INTO "articulos" ("cat_cod", "art_nom") VALUES ($1, $2) RETURNING "art_cod"  [["cat_cod", 1], ["art_nom", "Vestido"]]

  def update
    respond_to do |format|
      if @articulo.update(articulo_params)
---
UPDATE "articulos" SET "cat_cod" = $1, "art_nom" = $2 WHERE "articulos"."art_cod" = 1  [["cat_cod", 7], ["art_nom", "Vestido diseño con brillos"]]