app/controllers/categoris_controller.rb

  def index
    @categoris = Categori.all
---
SELECT "categoris".* FROM "categoris"

  def show
    @instancis=[]
    @articulos = Articulo.where(cat_cod: @categori.id)
    @imagenes=Imagen.where("LENGTH(imagen_uri) > ?",0)
    @articulos.each do |articulo|
      @imagenes.each do |imagen|
        if current_user && current_user.role=='vendedor'
          @instancis=@instancis+(Instanci.where(art_cod: articulo.art_cod))
        else
          @instancis=@instancis+(Instanci.where(ins_cod_prov: imagen.ins_cod_prov, art_cod: articulo.art_cod))
---
SELECT "articulos".* FROM "articulos" WHERE "articulos"."cat_cod" = $1  [["cat_cod", 3]]
SELECT "imagens".* FROM "imagens" WHERE (LENGTH(imagen_uri) > 0)
SELECT  "instancis".* FROM "instancis" WHERE "instancis"."ins_cod_prov" = $1 AND "instancis"."art_cod" = $2 LIMIT 1  [["ins_cod_prov", "adcd"], ["art_cod", 1]]

  def create
    @categori = Categori.new(categori_params)
    @categori.cat_nom=@categori.cat_nom.capitalize
    respond_to do |format|
      if @categori.save
---
INSERT INTO "categoris" ("cat_cat_cod", "cat_nom") VALUES ($1, $2) RETURNING "cat_cod"  [["cat_cat_cod", 7], ["cat_nom", "asd1"]]