app/controllers/detalle_pedidos_controller.rb

SELECT "detalle_pedidos".* FROM "detalle_pedidos"
---
  def index
    @detalle_pedidos = DetallePedido.all

INSERT INTO "detalle_pedidos" ("ped_cod", "det_ped_linea", "ins_cod", "ins_cod_prov", "det_ped_cant", "det_ped_precio") VALUES ($1, $2, $3, $4, $5, $6)  [["ped_cod", 1], ["det_ped_linea", 1], ["ins_cod", 1], ["ins_cod_prov", "1"], ["det_ped_cant", 1], ["det_ped_precio", 1]]
---
  def create
    @detalle_pedido = DetallePedido.new(detalle_pedido_params)

    respond_to do |format|
      if @detalle_pedido.save