app/controllers/detalle_documento_de_compras_controller.rb

SELECT "detalle_documento_de_compras".* FROM "detalle_documento_de_compras"
---
  def index
    @detalle_documento_de_compras = DetalleDocumentoDeCompra.all

INSERT INTO "detalle_documento_de_compras" ("doc_com_cod", "det_doc_com_linea", "ins_cod", "ins_cod_prov", "det_doc_com_cant", "det_doc_com_precio", "det_doc_com_precio_uni") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "doc_com_cod","det_doc_com_linea"  [["doc_com_cod", 1], ["det_doc_com_linea", 1], ["ins_cod", 1], ["ins_cod_prov", "1"], ["det_doc_com_cant", 1], ["det_doc_com_precio", 1], ["det_doc_com_precio_uni", 1]]
---
  def create
    @detalle_documento_de_compra = DetalleDocumentoDeCompra.new(detalle_documento_de_compra_params)

    respond_to do |format|
      if @detalle_documento_de_compra.save