app/controllers/documento_de_compras_controller.rb

INSERT INTO "documento_de_compras" ("est_dc_cod", "ven_cod", "guia_desp_cod", "cli_cod", "doc_cob_cod", "doc_com_met_ent", "doc_com_met_pago", "doc_com_tipo", "doc_com_fecha") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "doc_com_cod"
---
  def create
    @documento_de_compra = DocumentoDeCompra.new(documento_de_compra_params)

    respond_to do |format|
      if @documento_de_compra.save