app/controllers/estado_articulos_controller.rb

SELECT "estado_articulos".* FROM "estado_articulos"
---
  def index
    @estado_articulos = EstadoArticulo.all

INSERT INTO "estado_articulos" ("est_art_nom") VALUES ($1) RETURNING "est_art_cod"  [["est_art_nom", "En tienda"]]
---
  def create
    @estado_articulo = EstadoArticulo.new(estado_articulo_params)

    respond_to do |format|
      if @estado_articulo.save