app/controllers/imagens_controller.rb

  def index
    @imagens = Imagen.all
---
SELECT "imagens".* FROM "imagens"

  def create
    @imagen = Imagen.new(imagen_params)

    respond_to do |format|
      if @imagen.save
---
INSERT INTO "imagens" ("ins_cod", "ins_cod_prov", "imagen_uri") VALUES ($1, $2, $3) RETURNING "imagen_cod"  [["ins_cod", 8], ["ins_cod_prov", "adcd"], ["imagen_uri", ""]]

  def update
    respond_to do |format|
      if @imagen.update(imagen_params)
---
UPDATE "imagens" SET "imagen_uri" = $1 WHERE "imagens"."imagen_cod" = 6  [["imagen_uri", "sexdcrftgh"]]