app/controllers/instancis_controller.rb

  def index
    @instancis = Instanci.all
---
SELECT "instancis".* FROM "instancis"

  def create
    @instanci = Instanci.new(instanci_params)
    if @instanci.imagens[0]!=nil
      @instanci.imagens[0].ins_cod_prov=@instanci.ins_cod_prov
    end
    @instancias=Instanci.where(ins_cod_prov: @instanci.ins_cod_prov)
    respond_to do |format|
      if @instanci.save
---
INSERT INTO "instancis" ("ins_cod", "ins_cod_prov", "est_art_cod", "art_cod", "ins_stock", "ins_precio_lista", "ins_precio_prov") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "ins_cod","ins_cod_prov"  [["ins_cod", 1], ["ins_cod_prov", "1"], ["est_art_cod", 1], ["art_cod", 1], ["ins_stock", 1], ["ins_precio_lista", 1], ["ins_precio_prov", 1]]