app/controllers/propiedad_valors_controller.rb

SELECT "propiedad_valors".* FROM "propiedad_valors"
---
  def index
    @propiedad_valors = PropiedadValor.all

INSERT INTO "propiedad_valors" ("val_cod", "prop_cod") VALUES ($1, $2) RETURNING "prop_val_cod"  [["val_cod", 1], ["prop_cod", 1]]
---
  def create
    @propiedad_valor = PropiedadValor.new(propiedad_valor_params)

    respond_to do |format|
      if @propiedad_valor.save

SELECT  "propiedad_valors".* FROM "propiedad_valors" WHERE "propiedad_valors"."prop_val_cod" = $1 LIMIT 1  [["prop_val_cod", 0]]
---
    def set_propiedad_valor
      @propiedad_valor = PropiedadValor.find(params[:prop_val_cod])