app/controllers/propiedads_controller.rb

  def index
    @propiedads = Propiedad.all
---
SELECT "propiedads".* FROM "propiedads"

  def create
    @propiedad = Propiedad.new(propiedad_params)
    @propiedad.prop_nom=@propiedad.prop_nom.capitalize
    @propiedad.propiedad_valors.length.times do |i|
      @propiedad.propiedad_valors[i].valor.val_nom=@propiedad.propiedad_valors[i].valor.val_nom.capitalize
    end
    respond_to do |format|
    if @propiedad.save
---
INSERT INTO "propiedads" ("prop_nom") VALUES ($1) RETURNING "prop_cod"  [["prop_nom", "Color"]]