app/controllers/valors_controller.rb

SELECT "valors".* FROM "valors"
---
  def index
    @valors = Valor.all

INSERT INTO "valors" ("val_nom") VALUES ($1) RETURNING "val_cod"  [["val_nom", "Azul"]]
---
  def create
    @valor = Valor.new(valor_params)
    respond_to do |format|
      if @valor.save